linkedin-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/linkedin/viewJobs.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.linkedin.viewjobs">
   <soapenv:Header/> 
   <soapenv:Body>
    <urn:appUri>http://api.linkedin.com/v1</urn:appUri>
  <urn:accessToken>AQVoQTu5J6L6S26opsmWOxbqoT7qsLc_mihlfsevxsSQlBsFxNwwRL6h8YiP8vR1feMsfKpUIW-BfzdUpo47F-MkYJAdqZkcmNUsRzn4PKpB5qlnPjusH2wWUPoFvdcIy_hoh8Dq68mG7H8BA15tZdSKijDDM6yKuHlBkb3GZqpbsUBnPlk</urn:accessToken>
   <urn:jobFields>id,customer-job-code</urn:jobFields>
    <urn:positionFieldsSet>title,location</urn:positionFieldsSet>
     <urn:job-PosterFieldsSet>id,headline</urn:job-PosterFieldsSet>
   <urn:companyFieldsSet>id,name</urn:companyFieldsSet>
   </soapenv:Body>
</soapenv:Envelope>
